// console.log("Текст из script.js");

// *******************************************************************

// Создайте переменную num и присвойте ей значение 123. Выведите значение этой переменной в консоль
// const num = 123;
// console.log(num);


// Создайте переменную а и присвойте ей значение 5, переопределите переменную а на значение 7, выведите переменную а в консоль
// let a = 5;
// a = 7;
// console.log(a);

// Создайте переменную b. Запишите в нее сумму чисел 1, 2 и 3. С помощью функции console.log выведите в консоль содержимое переменной b.
// let b = 1+2+3;
// console.log(b);


// Создайте 2 вида комментариев в вашем коде, добавьте в них произвольный текст

// многабукав
// на несколько строк. Нажимаем ctrl и / после выделения необходимых строк.

/*или так*/

// *******************************************************************

// Создайте переменную c со значением 10 и переменную d со значением 2.
// Все созданные переменные должны быть логично названы
// Создайте переменную суммы и присвойте сумму чисел (c,d)
// Создайте переменную разности и присвойте разность чисел (c,d)
// Создайте переменную прозведения и присвойте произведение чисел (c,d)
// Создайте переменную частного и присвойте деление чисел (c,d)
// Выведите в консоль все созданные переменные
// Сложите все созданные переменные и выведите результат в консоль

// const c = 10;
// const d = 2;
// const sum = c + d;
// const diff = c - d;
// const mult = c * d;
// const div = c / d;
// console.log(sum, diff, mult, div);
// console.log(c + d + sum + diff + mult + div);

// *******************************************************************
// Создайте строку с вашем именем и строку с вашей фамилией. Выведите эти данные в консоль

// const myName = "Nina";
// const myFirstName = "Pivneva";
// console.log(`My name is ${myName} ${myFirstName}.`);


// Создайте переменную с текстом 'java' и переменную с текстом 'script'. С помощью этих переменных и операции сложения строк выведите в консоль строку 'javascript'.

// let java = 'java';
// let script = 'script';
// console.log(java + script);


// Создайте переменную с текстом 'hello' и переменную с текстом 'world'. С помощью этих переменных и операции сложения строк выведите в консоль строку 'hello world'.

// let hello = 'hello';
// let world = 'world';
// console.log(hello + ' ' + world);